In [3]:
from pandas import Series
se=Series([10,20,30])

In [4]:
se

0    10
1    20
2    30
dtype: int64

In [5]:
se[2]

30

In [7]:
se=Series([100,200,300],index=['a','b','c'])

In [8]:
se

a    100
b    200
c    300
dtype: int64

In [10]:
se['c']

300

In [11]:
salary={'john':1000,'abin':4000,'shaun':6000}

In [12]:
a=Series(salary)

In [13]:
a

john     1000
abin     4000
shaun    6000
dtype: int64

In [14]:
a['abin']

4000

In [15]:
from pandas import DataFrame
data={'Name':['john','akhil','jerry'],
      'Age':[20,21,40],
      'Salary':[3000,7000,9000]}

In [16]:
obj=DataFrame(data)

In [17]:
obj

    Name  Age  Salary
0   john   20    3000
1  akhil   21    7000
2  jerry   40    9000

In [ ]:
new_frame=DataFrame